SOAP-XML.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="http://apicertificacion.desa.tekra.com.gt:8080/certificacion/wsdl/">
  <SOAP-ENV:Body>
    <ns1:CertificacionDocumento>

      <Autenticacion>
       <pn_usuario>tekra_api</pn_usuario>
        <pn_clave>123456789</pn_clave>
        <pn_cliente>2121010001</pn_cliente>
        <pn_contrato>2122010001</pn_contrato>
        <pn_id_origen>TEKRA_PRUEBA</pn_id_origen>
        <pn_ip_origen>192.168.0.100</pn_ip_origen>
        <pn_firmar_emisor>SI</pn_firmar_emisor>
      </Autenticacion>

      <Documento>
        <![CDATA[
<?xml version="1.0" encoding="UTF-8"?>
<dte:GTDocumento Version="0.1" xmlns:dte="http://www.sat.gob.gt/dte/fel/0.2.0" xmlns:cfc="
http://www.sat.gob.gt/dte/fel/CompCambiaria/0.1.0" xmlns:cex="
http://www.sat.gob.gt/face2/ComplementoExportaciones/0.1.0" xmlns:cfe="
http://www.sat.gob.gt/face2/ComplementoFacturaEspecial/0.1.0" xmlns:cno="
http://www.sat.gob.gt/face2/ComplementoReferenciaNota/0.1.0" xmlns:ds="
http://www.w3.org/2000/09/xmldsig#" xmlns:xsi="
http://www.w3.org/2001/XMLSchema-instance">
    <dte:SAT ClaseDocumento="dte">
        <dte:DTE ID="DatosCertificados">
            <dte:DatosEmision ID="DatosEmision">
                <dte:DatosGenerales Tipo="FACT" FechaHoraEmision="2025-06-09T10:18:08-06:00" CodigoMoneda="GTQ" />
                <dte:Emisor NITEmisor="107346834" 
                            NombreEmisor="TEKRA SOCIEDAD ANONIMA" 
                            CodigoEstablecimiento="1" 
                            NombreComercial="TEKRA SOCIEDAD ANONIMA" 
                            CorreoEmisor="" AfiliacionIVA="GEN">
                    <dte:DireccionEmisor>
                        <dte:Direccion>19 CALLE 18-48</dte:Direccion>
                        <dte:CodigoPostal>01010</dte:CodigoPostal>
                        <dte:Municipio>GUATEMALA</dte:Municipio>
                        <dte:Departamento>GUATEMALA</dte:Departamento>
                        <dte:Pais>GT</dte:Pais>
                    </dte:DireccionEmisor>
                </dte:Emisor>
                <dte:Receptor IDReceptor="12345679" 
                            NombreReceptor="Juan Perez" 
                            CorreoReceptor="perez@gmail.com">
                    <dte:DireccionReceptor>
                        <dte:Direccion>GUATEMALA</dte:Direccion>
                        <dte:CodigoPostal>0</dte:CodigoPostal>
                        <dte:Municipio></dte:Municipio>
                        <dte:Departamento></dte:Departamento>
                        <dte:Pais>GT</dte:Pais>
                    </dte:DireccionReceptor>
                </dte:Receptor>
                <dte:Frases>
                    <dte:Frase TipoFrase="1" CodigoEscenario="1" />
                </dte:Frases>
                <dte:Items>
                    <dte:Item NumeroLinea="1" BienOServicio="B">
                        <dte:Cantidad>10.0000</dte:Cantidad>
                        <dte:Descripcion>Descripción prueba</dte:Descripcion>
                        <dte:PrecioUnitario>25.0000</dte:PrecioUnitario>
                        <dte:Precio>250.0000</dte:Precio>
                        <dte:Descuento>0.0000</dte:Descuento>
                        <dte:Impuestos>
                            <dte:Impuesto>
                                <dte:NombreCorto>IVA</dte:NombreCorto>
                                <dte:CodigoUnidadGravable>1</dte:CodigoUnidadGravable>
                                <dte:MontoGravable>223.2143</dte:MontoGravable>
                                <dte:MontoImpuesto>26.7857</dte:MontoImpuesto>
                            </dte:Impuesto>
                        </dte:Impuestos>
                        <dte:Total>250.0000</dte:Total>
                    </dte:Item>
                    <dte:Item NumeroLinea="2" BienOServicio="S">
                        <dte:Cantidad>10</dte:Cantidad>
                        <dte:Descripcion>Descripción del servicio</dte:Descripcion>
                        <dte:PrecioUnitario>25.0000</dte:PrecioUnitario>
                        <dte:Precio>250.0000</dte:Precio>
                        <dte:Descuento>0.0000</dte:Descuento>
                        <dte:Impuestos>
                            <dte:Impuesto>
                                <dte:NombreCorto>IVA</dte:NombreCorto>
                                <dte:CodigoUnidadGravable>1</dte:CodigoUnidadGravable>
                                <dte:MontoGravable>223.2143</dte:MontoGravable>
                                <dte:MontoImpuesto>26.7857</dte:MontoImpuesto>
                            </dte:Impuesto>
                        </dte:Impuestos>
                        <dte:Total>250.0000</dte:Total>
                    </dte:Item>
                </dte:Items>
                <dte:Totales>
                    <dte:TotalImpuestos>
                        <dte:TotalImpuesto NombreCorto="IVA" TotalMontoImpuesto="53.5714" />
                    </dte:TotalImpuestos>
                    <dte:GranTotal>500.0000</dte:GranTotal>
                </dte:Totales>
            </dte:DatosEmision>
        </dte:DTE>
	    <dte:Adenda>
           <DECertificador>88851</DECertificador>
        </dte:Adenda>
    </dte:SAT>
</dte:GTDocumento>
        ]]>
      </Documento>

    </ns1:CertificacionDocumento>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>